# CannotConstrainBasePointDimensions Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..CannotConstrainBasePointDimensions Property
BuiltInFailures..::..DimensionFailures Class See Also
---
Dimensions to base points cannot be constrained.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId CannotConstrainBasePointDimensions { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CannotConstrainBasePointDimensions As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ CannotConstrainBasePointDimensions {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace